app/controllers/application_controller.rb

  def require_owner
    review = Review.find(params[:id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = 1 LIMIT 1