app/controllers/parttime_jobs_controller.rb

  def index
    if params[:category].present?
      @parttime_jobs = ParttimeJob.where(category: params[:category])
    else
      @parttime_jobs = ParttimeJob.all
---
SELECT "parttime_jobs".* FROM "parttime_jobs" WHERE "parttime_jobs"."category" = '飲食'
SELECT "parttime_jobs".* FROM "parttime_jobs"

  def show
    @review = Review.new
    @reviews = @parttime_job.reviews.includes(:user)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."parttime_job_id" = 1 ORDER BY created_at desc
SELECT "users".* FROM "users" WHERE "users"."id" IN (4, 5)

  def create
    @parttime_job = ParttimeJob.new(parttime_job_params)

    respond_to do |format|
      if @parttime_job.save
---
INSERT INTO "parttime_jobs" ("name", "category", "created_at", "updated_at") VALUES ('黒猫ヤマト', '運輸', '2025-07-07 12:09:15.569913', '2025-07-07 12:09:15.569913') RETURNING "id"

  def update
    respond_to do |format|
      if @parttime_job.update(parttime_job_params)
---
UPDATE "parttime_jobs" SET "category" = '教育', "updated_at" = '2025-07-14 06:01:49.230518' WHERE "parttime_jobs"."id" = 13

    def set_parttime_job
      @parttime_job = ParttimeJob.find(params[:id])
---
SELECT "parttime_jobs".* FROM "parttime_jobs" WHERE "parttime_jobs"."id" = 1 LIMIT 1