app/controllers/reviews_controller.rb

  def create
    @parttime_job = ParttimeJob.find(params[:parttime_job_id])
    @review = @parttime_job.reviews.build(review_params)
    @review.user = current_user

    respond_to do |format|
      if @review.save
---
SELECT "parttime_jobs".* FROM "parttime_jobs" WHERE "parttime_jobs"."id" = 1 LIMIT 1
INSERT INTO "reviews" ("user_id", "parttime_job_id", "rating", "content", "image", "created_at", "updated_at") VALUES (5, 1, NULL, '', NULL, '2025-07-07 08:17:34.407578', '2025-07-07 08:17:34.407578') RETURNING "id"

  def update
    respond_to do |format|
      if @review.update(review_params)
---
UPDATE "reviews" SET "content" = 'コーヒーうまうま！', "updated_at" = '2025-07-07 08:19:30.687612' WHERE "reviews"."id" = 1

  def destroy
    @review.destroy!
---
DELETE FROM "reviews" WHERE "reviews"."id" = 2

  def my_reviews
    if logged_in?
      @reviews = current_user.reviews.includes(:parttime_job)
---
SELECT "parttime_jobs".* FROM "parttime_jobs" WHERE "parttime_jobs"."id" IN (1, 9, 16)
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = 4