app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ('Shujiro', 'a5823006', 'Haru', '2025-06-30 08:21:02.974497', '2025-06-30 08:21:02.974497') RETURNING "id"

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "name" = 'Takasi', "password_digest" = '$2a$12$OlgCaq5sghuHM.Teedob3eEpwaY.XVOzP/SojXAhm0rh5xvNnfkVe', "updated_at" = '2025-07-07 09:07:21.555267' WHERE "users"."id" = 8